/* %1$@ = current page; %2$@ = number of pages */
"%1$@ of %2$@" = "%1$@ จาก %2$@";

/* %1$@ = source name (e.g. “another app”); %2$@ = non-relative localized date/time string (e.g. “Dec 1, 2017 at 3:53 PM”) */
"This shortcut was imported from %1$@ on %2$@." = "คำสั่งลัดนี้ถูกนำเข้ามาจาก %1$@ เมื่อ %2$@";

/* %1$@ = source name (e.g. “another app”); %2$@ = relative localized date/time string (e.g. “yesterday at 3:53 PM”) */
"This shortcut was imported from %1$@ %2$@." = "คำสั่งลัดนี้ถูกนำเข้ามาจาก %1$@ %2$@";

/* %@ = action name */
"Add “%@”" = "เพิ่ม “%@”";

/* %@ = action name */
"Remove “%@”" = "เอา “%@” ออก";

/* %@ = service name */
"Do you want to sign out of %@ in Shortcuts?" = "คุณต้องการลงชื่อออกจาก %@ ในคำสั่งลัดหรือไม่";

/* %@ = service name */
"Do you want to sign out of %@?" = "คุณต้องการลงชื่อออกจาก %@ หรือไม่";

/* %@ = source app name */
"This shortcut was imported from %@. Are you sure you want to run it?" = "คำสั่งลัดนี้ถูกนำเข้ามาจาก %@ คุณแน่ใจหรือไม่ว่าคุณต้องการสั่งทำงานคำสั่งลัดนี้";

/* %@ = type (can also be empty string); e.g. “as Date”; above it, there is a variable name such as “Event” */
"as %@" = "เป็น %@";

/* %@=action name */
"Delete the actions inside “%@”, too?" = "ลบการกระทำภายใน “%@” ด้วยหรือไม่";

/* %@=app name */
"Install %@" = "ติดตั้ง %@";

/* A label for the row in settings that shows the Siri phrase that the user has configured for a workflow */
"Siri Phrase" = "คำสั่ง Siri";

/* Access resource action settings title */
"Accounts" = "บัญชี";

/* Accessibility accouncement */
"Finished editing shortcuts" = "แก้ไขคำสั่งลัดเสร็จเรียบร้อยแล้ว";

/* Accessibility accouncement; %@=action name */
"Favorited %@" = "%@ เป็นรายการโปรดแล้ว";

/* Accessibility accouncement; %@=action name */
"Un-favorited %@" = "เอา %@ ออกจากรายการโปรดแล้ว";

/* Accessibility accouncement; shortcut started running */
"Running shortcut" = "กำลังสั่งทำงานคำสั่งลัด";

/* Accessibility action */
"Delete shortcut" = "ลบคำสั่งลัด";

/* Accessibility action */
"Duplicate shortcut" = "ทำสำเนาคำสั่งลัด";

/* Accessibility action */
"Favorite Action" = "การกระทำรายการโปรด";

/* Accessibility action */
"Rename shortcut" = "เปลี่ยนชื่อคำสั่งลัด";

/* Accessibility action */
"Un-favorite Action" = "เอาการกระทำออกจากรายการโปรด";

/* Accessibility action or discoverability title */
"Edit shortcut" = "แก้ไขคำสั่งลัด";

/* Accessibility action or discoverability title */
"Run shortcut" = "สั่งทำงานคำสั่งลัด";

/* Accessibility annoucement when inserting an action to a shortcut; %@ = action name */
"added %@ to shortcut" = "เพิ่ม %@ ไปยังคำสั่งลัดแล้ว";

/* Accessibility annoucement; input types that are accepted */
"Accepted Input Types" = "ประเภทของข้อมูลเข้าที่ยอมรับ";

/* Accessibility announcement */
"Closed variables tray" = "ปิดถาดตัวแปรแล้ว";

/* Accessibility announcement */
"Editing shortcuts" = "กำลังแก้ไขคำสั่งลัด";

/* Accessibility announcement */
"Opened variables tray" = "เปิดถาดตัวแปรแล้ว";

/* Accessibility announcement spoken aloud when the user starts dragging */
"dragging" = "กำลังลาก";

/* Accessibility announcement that shortcut finished running */
"Shortcut finished" = "สั่งทำงานคำสั่งลัดเสร็จเรียบร้อยแล้ว";

/* Accessibility announcement when inserting an action above another action, %1$@ & %2$@ = action names */
"added %1$@ to shortcut above %2$@" = "เพิ่ม %1$@ ไปยังคำสั่งลัดด้านบน %2$@ แล้ว";

/* Accessibility announcement when inserting an action below another action, %1$@ & %2$@ = action names */
"added %1$@ to shortcut below %2$@" = "เพิ่ม %1$@ ไปยังคำสั่งลัดด้านล่าง %2$@ แล้ว";

/* Accessibility announcement when moving an action in a shortcut above another action; %@=action name */
"moved above %@" = "เลื่อนอยู่เหนือ %@";

/* Accessibility announcement when moving an action in a shortcut below another action; %@=action name */
"moved below %@" = "เลื่อนอยู่ใต้ %@";

/* Accessibility announcement when removing an action from a shortcut; %@=action name */
"removed %@" = "เอา %@ ออกแล้ว";

/* Accessibility announcement; %@ = shortcut name */
"Duplicated %@" = "ทำสำเนา %@ แล้ว";

/* Accessibility announcement; collapsed parameter */
"collapsed" = "ยุบแล้ว";

/* Accessibility announcement; dragging a shortcut */
"Dragging" = "การลาก";

/* Accessibility announcement; expanded parameter */
"expanded" = "ขยายแล้ว";

/* Accessibility announcement; shortcut stopped running because it was paused */
"Shortcut stopped" = "หยุดคำสั่งลัดแล้ว";

/* Accessibility hint */
"Closes the shortcut" = "ปิดคำสั่งลัด";

/* Accessibility hint */
"Creates a new shortcut" = "สร้างคำสั่งลัดใหม่";

/* Accessibility hint */
"Deletes the selected shortcuts" = "ลบคำสั่งลัดที่เลือก";

/* Accessibility hint */
"Double-tap to add to the bottom of the shortcut. Double-tap and hold, then drag to customize the position in the shortcut." = "แตะสองครั้งเพื่อเพิ่มไปยังด้านล่างสุดของคำสั่งลัด แตะสองครั้งค้างไว้ แล้วลากเพื่อกำหนดตำแหน่งในคำสั่งลัดเอง";

/* Accessibility hint */
"Draggable. Double-tap and hold, wait for the sound, then drag to re-order. Double tap to select." = "สามารถลากได้ แตะสองครั้งค้างไว้ รอจนเสียงดังขึ้น แล้วลากเพื่อจัดลำดับอีกครั้ง จากนั้นแตะสองครั้งเพื่อเลือก";

/* Accessibility hint */
"Duplicates the selected shortcuts" = "ทำสำเนาคำสั่งลัดที่เลือก";

/* Accessibility hint */
"This shortcut will be displayed in the Shortcuts action extension (in the iOS share menu) when the content being shared is one of the types you select here." = "คำสั่งลัดนี้จะแสดงในส่วนขยายการกระทำคำสั่งลัด (ในเมนูแชร์ของ iOS) เมื่อเนื้อหาที่แชร์อยู่เป็นประเภทใดประเภทหนึ่งที่คุณเลือกที่นี่";

/* Accessibility hint */
"Turns off shortcut editing mode" = "ปิดใช้โหมดการแก้ไขคำสั่งลัด";

/* Accessibility hint */
"Turns on shortcut editing mode" = "เปิดใช้โหมดการแก้ไขคำสั่งลัด";

/* Accessibility hint for collapsing the actions drawer */
"Double-tap to collapse the actions drawer to half screen" = "แตะสองครั้งเพื่อยุบลิ้นชักการกระทำเป็นครึ่งจอ";

/* Accessibility hint for expanding the actions drawer */
"Double-tap to fully expand the actions drawer" = "แตะสองครั้งเพื่อขยายลิ้นชักการกระทำให้เต็ม";

/* Accessibility hint on action */
"Double-tap to read the action description." = "แตะสองครั้งเพื่ออ่านคำอธิบายการกระทำ";

/* Accessibility hint on action */
"Draggable. Double-tap and hold, wait for the sound, then drag to re-order. Double-tap to read the action description." = "สามารถลากได้ แตะสองครั้งค้างไว้ รอจนเสียงดังขึ้น แล้วลากเพื่อจัดลำดับอีกครั้ง จากนั้นแตะสองครั้งเพื่ออ่านคำอธิบายการกระทำ";

/* Accessibility hint; Workflow Sync switch control */
"Double tap to toggle setting" = "แตะสองครั้งเพื่อสลับการตั้งค่า";

/* Accessibility hint; choose parameter */
"Double tap to choose" = "แตะสองครั้งเพื่อเลือก";

/* Accessibility hint; collapse parameter */
"Double-tap to collapse" = "แตะสองครั้งเพื่อยุบ";

/* Accessibility hint; double tap to insert variable */
"Double tap to insert" = "แตะสองครั้งเพื่อแทรก";

/* Accessibility hint; expand parameter */
"Double-tap to expand" = "แตะสองครั้งเพื่อขยาย";

/* Accessibility hint; shortcut cell; %@=shortcut name */
"Runs the shortcut %@" = "สั่งทำงานคำสั่งลัด %@";

/* Accessibility label */
"Add Tag" = "เพิ่มแท็ก";

/* Accessibility label */
"Close" = "ปิด";

/* Accessibility label */
"Create Shortcut" = "สร้างคำสั่งลัด";

/* Accessibility label */
"Show Keyboard" = "แสดงแป้นพิมพ์";

/* Accessibility label for containers of nested actions, ex: Inside of Repeat */
"Inside of %@" = "ภายใน %@";

/* Accessibility label or discoverability title */
"Redo" = "ทำกลับมาใหม่";

/* Accessibility label or discoverability title */
"Undo" = "เลิกทำ";

/* Accessibility label to convey minimized state of actions table view */
"Minimized" = "ย่ออยู่";

/* Accessibility label to convey the collapsed state of the actions table view when it is only partially expanded */
"Half screen" = "ครึ่งหน้าจอ";

/* Accessibility label to convey the fully expanded state of the actions table view */
"Full screen" = "เต็มหน้าจอ";

/* Accessibility label; %@ = action name, %d = action progress; e.g. Download URL action - Running - 38 percent completed */
"%@ action - Running - %d percent completed" = "การกระทำ %@ - การวิ่ง - เสร็จ %d เปอร์เซ็นต์";

/* Accessibility label; %@ = action name; e.g. Show Alert action, New Ulysses Group action */
"%@ action" = "การกระทำ %@";

/* Accessibility label; remove search filter */
"Remove filter" = "เอาฟิลเตอร์ออก";

/* Accessibility label; shortcut cell not selected; %@=shortcut name */
"%@ (not selected)" = "%@ (ไม่ได้เลือก)";

/* Accessibility value; switch is on */
"On" = "เปิดอยู่";

/* Accessiblity announcement; release finger to remove; %@=action name */
"Release to remove %@" = "ยกนิ้วออกเพื่อเอา %@ ออก";

/* Action does not do anything to input and simply returns it as the output */
"This action passes input through as output." = "การกระทำนี้ส่งผ่านข้อมูลเข้าเป็นข้อมูลออก";

/* Action extension input variable description */
"Gets the input that was passed into the beginning of the shortcut." = "รับข้อมูลเข้าที่ส่งผ่านไปยังจุดเริ่มต้นของคำสั่งลัด";

/* Action extension; no Share Sheet shortcuts */
"You don’t have any Share Sheet shortcuts yet.\n\nTo add one, create a shortcut and turn on “Show in Share Sheet” in its settings." = "คุณยังไม่มีคำสั่งลัดแผ่นงานการแชร์\n\nในการเพิ่มคำสั่งลัด ให้สร้างคำสั่งลัดแล้วเปิดใช้ “แสดงในแผ่นงานการแชร์” ในการตั้งค่าของคำสั่งลัดนั้น";

/* Action extension; no search results */
"No shortcuts match the search." = "ไม่มีคำสั่งลัดที่ตรงกับการค้นหา";

/* Action extension; no shortcuts */
"You don’t have any shortcuts yet." = "คุณยังไม่มีคำสั่งลัดใดๆ เลย";

/* Actions provided by Siri Suggestions; title or button */
"Siri Suggestions" = "คำแนะนำโดย Siri";

/* Activity subject; %@ = shortcut name */
"Shortcut: %@" = "คำสั่งลัด: %@";

/* Add action to a shortcut button title */
"Add to this shortcut" = "เพิ่มไปยังคำสั่งลัดนี้";

/* Add search filter */
"Add Filter" = "เพิ่มฟิลเตอร์";

/* Alert body for creating iCloud link */
"Anyone with access to this shared link will be able to view the contents of this shortcut." = "ทุกคนที่สามารถเข้าลิงก์ที่แชร์นี้ได้จะสามารถดูเนื้อหาของคำสั่งลัดนี้ได้";

/* Alert title */
"Error" = "ข้อผิดพลาด";

/* Alert title for creating iCloud link */
"Create iCloud Link" = "สร้างลิงก์ iCloud";

/* Allow access to service */
"Allow Access" = "อนุญาตให้เข้าถึง";

/* App not installed; accessiblity hint */
"(Not Installed) %@" = "(ไม่ได้ติดตั้ง) %@";

/* App search view; navigation bar title */
"Choose App" = "เลือกแอพ";

/* App search view; no results */
"No results." = "ไม่มีผลการค้นหา";

/* App search view; search bar placeholder */
"Search apps…" = "ค้นหาแอพ…";

/* Apple Watch complication */
"Complication" = "กลไกหน้าปัด";

/* Apple Watch shortcuts empty state */
"You don’t have any Apple Watch shortcuts yet." = "คุณยังไม่มีคำสั่งลัดใดๆ สำหรับ Apple Watch เลย";

/* Apple Watch shortcuts empty state description */
"Select which shortcuts should be displayed in the Shortcuts Complication on the clock face of your Apple Watch.\n\nOver time, Shortcuts will optimize when your shortcuts are shown in the Complication based on when you run them." = "เลือกคำสั่งลัดที่ควรจะแสดงในกลไกหน้าปัดคำสั่งลัดบนหน้าปัดนาฬิกาของ Apple Watch ของคุณ\n\nคำสั่งลัดจะปรับเวลาแสดงคำสั่งลัดของคุณให้เหมาะสมตลอดเวลาในกลไกหน้าปัดโดยอิงตามเวลาที่คุณสั่งทำงานคำสั่งลัดเหล่านั้น";

/* Apps category */
"Apps" = "แอพ";

/* Ask When Run variable description */
"Asks you to enter text when this shortcut runs." = "ขอให้คุณป้อนข้อความเมื่อคำสั่งลัดนี้ทำงาน";

/* Boolean false */
"False" = "เท็จ";

/* Boolean true */
"True" = "จริง";

/* Button */
"Back" = "ย้อนกลับ";

/* Button */
"Cancel" = "ยกเลิก";

/* Button */
"Choose Variable" = "เลือกตัวแปร";

/* Button */
"Clear" = "ล้าง";

/* Button */
"Delete Actions" = "ลบการกระทำ";

/* Button */
"Delete Shortcut" = "ลบคำสั่งลัด";

/* Button */
"Done" = "เสร็จสิ้น";

/* Button */
"Get More Shortcuts" = "รับคำสั่งลัดเพิ่มเติม";

/* Button */
"Go Back" = "ย้อนกลับ";

/* Button */
"Help" = "วิธีใช้";

/* Button */
"Keep Actions" = "เก็บการกระทำ";

/* Button */
"Next" = "ถัดไป";

/* Button */
"OK" = "ตกลง";

/* Button */
"Remove Action" = "เอาการกระทำออก";

/* Button */
"Remove Action From Shortcut" = "เอาการกระทำออกจากคำสั่งลัด";

/* Button */
"Remove Photo" = "เอารูปภาพออก";

/* Button */
"Select Magic Variable" = "เลือกตัวแปร Magic";

/* Button */
"Select Photo" = "เลือกรูปภาพ";

/* Button */
"Show Action Settings" = "แสดงการตั้งค่าการกระทำ";

/* Button */
"Show Actions" = "แสดงการกระทำ";

/* Button */
"Sign Out" = "ลงชื่อออก";

/* Button */
"Take Photo" = "ถ่ายรูป";

/* Button in Share Sheet; add this shortcut to home screen */
"Add to Home Screen (Share Sheet)" = "เพิ่มไปยังหน้าจอโฮม";

/* Button in Workflow settings; add this shortcut to home screen */
"Add to Home Screen (Workflow Settings)" = "เพิ่มไปยังหน้าจอโฮม";

/* Button or title */
"Delete" = "ลบ";

/* Button or title */
"Run Shortcut" = "สั่งทำงานคำสั่งลัด";

/* Button or title */
"Settings" = "การตั้งค่า";

/* Button or title */
"Variables" = "ตัวแปร";

/* Button title */
"Add to Siri" = "เพิ่มไปยัง Siri";

/* Button title to import a shortcut */
"Get Shortcut" = "รับคำสั่งลัด";

/* Button; makes output view full screen */
"Show Result Full-Screen" = "แสดงผลลัพธ์แบบเต็มหน้าจอ";

/* Button; take a guided tour of building a workflow */
"Take a Guided Tour" = "เดินเที่ยวชม";

/* Button; used for sharing a shortcut's result */
"Share Result" = "แชร์ผลลัพธ์";

/* Caption above list of supported apps and services */
"This shortcut works with the following apps and services:" = "คำสั่งลัดนี้ใช้ได้กับแอพและบริการต่อไปนี้:";

/* Choose an item */
"Choose" = "เลือก";

/* Conditional AND */
"and" = "และ";

/* Conditional actions settings cell */
"Put Back “Otherwise”" = "นำกลับ “มิฉะนั้น”";

/* Conditional actions settings footer text */
"Actions placed after “Otherwise” will run if the condition is false." = "การกระทำที่วางต่อจาก “มิเช่นนั้น” จะทำงานหากเงื่อนไขเป็นเท็จ";

/* Conditional actions settings navigation bar title */
"If Action" = "การกระทำถ้า";

/* Confirmation HUD when link copies */
"Link copied" = "คัดลอกลิงก์แล้ว";

/* Confirmation dialog, stop sharing */
"Are you sure you want to stop sharing this shortcut? The iCloud link will be deleted and will no longer work." = "คุณแน่ใจหรือไม่ว่าคุณต้องการหยุดแชร์คำสั่งลัดนี้ ลิงก์ iCloud จะถูกลบและไม่ทำงานอีกต่อไป";

/* Confirmation when deleting selected shortcut */
"This shortcut will be deleted from all of your iCloud devices." = "คำสั่งลัดนี้จะถูกลบออกจากอุปกรณ์ iCloud ของคุณทุกเครื่อง";

/* Confirmation when deleting selected shortcuts */
"These shortcuts will be deleted from all of your iCloud devices." = "คำสั่งลัดเหล่านี้จะถูกลบออกจากอุปกรณ์ iCloud ของคุณทุกเครื่อง";

/* Contact field; %1$@ = user entered contact; %2$@ = “a phone number or email address” or “an email address” or “a phone number” */
"“%1$@” doesn’t look like %2$@. Did you mean to add a contact?" = "“%1$@” ดูไม่เหมือน %2$@ คุณตั้งใจจะเพิ่มรายชื่อใช่หรือไม่";

/* Contact field; %@ = user entered contact */
"Use “%@” Anyway" = "ยืนยันใช้ “%@”";

/* Contact field; accessibility label */
"Add Contact" = "เพิ่มรายชื่อ";

/* Contact field; button */
"Search Contacts" = "ค้นหาในรายชื่อ";

/* Contact field; supported type string */
"a phone number" = "เบอร์โทรศัพท์";

/* Contact field; supported type string */
"a phone number or email address" = "เบอร์โทรศัพท์หรือที่อยู่อีเมล";

/* Contact field; supported type string */
"an email address" = "ที่อยู่อีเมล";

/* Content Types category */
"Content Types" = "ประเภทเนื้อหา";

/* Copy link to shortcut */
"Copy Link" = "คัดลอกลิงก์";

/* Copy the link to a shortcut */
"Copy iCloud Link" = "คัดลอกลิงก์ iCloud";

/* Custom date format alert message */
"This format follows the patterns in Unicode Technical Standard #35." = "รูปแบบนี้จะเป็นไปตามรูปแบบใน Unicode Technical Standard #35";

/* Custom date format alert title */
"Custom Date Format" = "รูปแบบวันที่ที่กำหนดเอง";

/* Custom date formatting style */
"Custom" = "กำหนดเอง";

/* Custom time format title */
"Custom Format" = "รูปแบบกำหนดเอง";

/* Default option */
"Default" = "ค่าเริ่มต้น";

/* Delete all shortcuts */
"Delete All" = "ลบทั้งหมด";

/* Delimeter for input types */
", " = ", ";

/* Deselect all input types */
"Deselect All" = "เลิกเลือกทั้งหมด";

/* Dictionary key placeholder */
"Key" = "ปุ่ม";

/* Discoverability or accessibility title */
"Shortcut Settings" = "การตั้งค่าคำสั่งลัด";

/* Discoverability or accessibility title */
"Stop Shortcut" = "หยุดคำสั่งลัด";

/* Discoverability title */
"Close shortcut" = "ปิดคำสั่งลัด";

/* Discoverability title */
"Search actions" = "การกระทำการค้นหา";

/* Discoverability title */
"Stop shortcut" = "หยุดคำสั่งลัด";

/* Displayed next to a switch to configure whether or not a workflow should appear in the share sheet */
"Show in Share Sheet" = "แสดงในแผ่นงานการแชร์";

/* Displayed next to a switch to configure whether or not a workflow should be shown in the Workflow widget */
"Show in Widget" = "แสดงในวิดเจ็ต";

/* Displayed next to a switch to configure whether or not a workflow should be shown in the watch complication */
"Show in Complication" = "แสดงในกลไกหน้าปัด";

/* Displayed next to a switch to configure whether or not a workflow should be shown on the Apple Watch */
"Show on Apple Watch" = "แสดงบน Apple Watch";

/* Duplicate a shortcut */
"Duplicate Shortcut" = "ทำสำเนาคำสั่งลัด";

/* Duplicate shortcut */
"Duplicate" = "ทำสำเนา";

/* Edit import questions back bar button title */
"Questions" = "คำถาม";

/* Error message */
"No options available." = "ไม่มีตัวเลือกให้ใช้งานได้";

/* Error message; %@=error info */
"Could not load the App Store.\n\n%@" = "ไม่สามารถโหลด App Store ได้\n\n%@";

/* Explanation of what users can do by selecting the shortcuts shown underneath the text */
"Run shortcuts quickly using the widget." = "สั่งทำงานคำสั่งลัดอย่างรวดเร็วโดยใช้วิดเจ็ต";

/* Favorite button title - action is NOT yet favorited */
"Favorite" = "รายการโปรด";

/* Favorite button title - action is favorited */
"Favorited" = "เป็นรายการโปรดแล้ว";

/* Filled in with the user's account name, e.g. Account: johnmiller@gmail.com */
"Account: %@" = "บัญชี: %@";

/* Find and filter UI; all of the below conditions are true */
"All of the following are true" = "รายการต่อไปนี้ทั้งหมดเป็นจริง";

/* Find and filter UI; any one of the below conditions are true */
"Any of the following are true" = "รายการใดๆ ต่อไปนี้เป็นจริง";

/* Find filter UI layout for filter with a property and an operator (e.g. '`Start Date` `is today`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator}" = "${property} ${operator}";

/* Find filter UI layout for filter with a property and an operator and a follow up requirement (e.g. '`Start Date` `is today` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${and}" = "${property} ${operator} ${and}";

/* Find filter UI layout for filter with a property, operator and 2 values (e.g. '`Start Date` `is between` `8/13/18` `and` `8/16/18`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${operator_and} ${other_value}" = "${property} ${operator} ${value} ${operator_and} ${other_value}";

/* Find filter UI layout for filter with a property, operator and 2 values and a follow up requirement (e.g. '`Start Date` `is between` `8/13/18` `and` `8/16/18` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${operator_and} ${other_value} ${and}" = "${property} ${operator} ${value} ${operator_and} ${other_value} ${and}";

/* Find filter UI layout for filter with a property, operator and value (e.g. '`Calendar` `is` `Work`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value}" = "${property} ${operator} ${value}";

/* Find filter UI layout for filter with a property, operator and value and a follow up requirement (e.g. '`Calendar` `is` `Work` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${and}" = "${property} ${operator} ${value} ${and}";

/* Find filter UI layout for filter with a property, operator, value and unit (e.g. '`Start Date` `is in the next` `5` `days`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${unit}" = "${property} ${operator} ${value} ${unit}";

/* Find filter UI layout for filter with a property, operator, value and unit and a follow up requirement (e.g. '`Start Date` `is in the next` `5` `days` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${unit} ${and}" = "${property} ${operator} ${value} ${unit} ${and}";

/* Find filter UI layout for filter with just a property (e.g. '`Is All Day`'). This is used just for layout and the content between ${} should not be localized */
"${property}" = "${property}";

/* Find filter UI layout for filter with just a property and a follow up requirement (e.g. '`Is All Day` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${and}" = "${property} ${and}";

/* Find filter UI operator */
"begins with" = "เริ่มด้วย";

/* Find filter UI operator */
"contains" = "ประกอบด้วย";

/* Find filter UI operator */
"does not contain" = "ไม่มี";

/* Find filter UI operator */
"ends with" = "ลงท้ายด้วย";

/* Find filter UI operator */
"is" = "คือ";

/* Find filter UI operator */
"is after" = "หลังจาก";

/* Find filter UI operator */
"is before" = "ก่อนหน้า";

/* Find filter UI operator */
"is between" = "ระหว่าง";

/* Find filter UI operator */
"is exactly" = "ตรงกับ";

/* Find filter UI operator */
"is greater than" = "มากกว่า";

/* Find filter UI operator */
"is greater than or equal to" = "มากกว่าหรือเท่ากับ";

/* Find filter UI operator */
"is in the last" = "คือในช่วง";

/* Find filter UI operator */
"is in the next" = "คือในอีก";

/* Find filter UI operator */
"is larger than" = "มากกว่า";

/* Find filter UI operator */
"is larger than or equal to" = "มากกว่าหรือเท่ากับ";

/* Find filter UI operator */
"is less than" = "น้อยกว่า";

/* Find filter UI operator */
"is less than or equal to" = "น้อยกว่าหรือเท่ากับ";

/* Find filter UI operator */
"is longer than" = "ยาวกว่า";

/* Find filter UI operator */
"is longer than or equal to" = "ยาวกว่าหรือเท่ากับ";

/* Find filter UI operator */
"is not" = "ไม่ใช่";

/* Find filter UI operator */
"is not exactly" = "ไม่ตรงกับ";

/* Find filter UI operator */
"is not on" = "ไม่ได้อยู่ใน";

/* Find filter UI operator */
"is on" = "อยู่ใน";

/* Find filter UI operator */
"is shorter than" = "สั้นกว่า";

/* Find filter UI operator */
"is shorter than or equal to" = "สั้นกว่าหรือเท่ากับ";

/* Find filter UI operator */
"is smaller than" = "เล็กกว่า";

/* Find filter UI operator */
"is smaller than or equal to" = "เล็กกว่าหรือเท่ากับ";

/* Find filter UI operator */
"is today" = "คือวันนี้";

/* Footer for section */
"Run this shortcut with your voice by adding it to Siri." = "สั่งทำงานคำสั่งลัดนี้ด้วยเสียงของคุณโดยเพิ่มคำสั่งลัดไปยัง Siri";

/* Footer for table view section */
"Use this shortcut from other apps by opening the share sheet and tapping Shortcuts." = "ใช้คำสั่งลัดนี้จากแอพอื่นๆ โดยการเปิดแผ่นงานการแชร์แล้วแตะ คำสั่งลัด";

/* For a dictionary; description */
"Enter a key to extract its value from the dictionary, or leave blank to get the entire dictionary." = "ป้อนคีย์เพื่อแยกค่าออกจากพจนานุกรม หรือปล่อยให้ว่างไว้เพื่อรับพจนานุกรมทั้งเล่ม";

/* Format with local device name, for disambiguating sync conflicts to the user */
"%@ (This Device)" = "%@ (อุปกรณ์เครื่องนี้)";

/* Full name of contact */
"Full Name" = "ชื่อเต็ม";

/* Full street address of location */
"Full Street Address" = "ที่อยู่เต็ม";

/* Get property */
"Get" = "รับ";

/* Get value for a dictionary key */
"Get Value for Key" = "รับค่าสำหรับกุญแจ";

/* Go to next import question */
"Continue" = "ดำเนินการต่อ";

/* Guided tour; drag actions to here hint */
"…to here" = "…มาที่นี่";

/* Guided tour; drag actions to here hint (accessibility hint) */
"Drag actions to here" = "ลากการกระทำมายังที่นี่";

/* Handoff info */
"This action, when run on Apple Watch, will require you to use Handoff and continue on your iPhone." = "เมื่อเรียกใช้การกระทำนี้บน Apple Watch คุณจะต้องใช้ Handoff และดำเนินการต่อบน iPhone ของคุณ";

/* Health quantity unit (e.g. mL); title */
"Unit" = "หน่วย";

/* ISO 8601 date formatting style */
"ISO 8601" = "ISO 8601";

/* ISO 8601 date formatting style */
"ISO 8601 Time" = "ISO 8601 Time";

/* Icon editor accessibility label; %1$@ = glyph name, %2$@ = color name */
"%1$@ glyph, %2$@ background color" = "สัญลักษณ์ %1$@ พื้นหลังสี%2$@";

/* Icon editor tip text */
"Choose a custom image to use when this shortcut is added to the home screen." = "เลือกภาพแบบกำหนดเองเพื่อใช้เมื่อคำสั่งลัดนี้ถูกเพิ่มไปยังหน้าจอโฮม";

/* Icon editor tip text */
"The image above will be used when this shortcut is added to the home screen." = "ภาพด้านบนจะถูกใช้เมื่อคำสั่งลัดนี้ถูกเพิ่มไปยังหน้าจอโฮม";

/* Icon editor; accessibility label */
"Icon Preview" = "การแสดงตัวอย่างไอคอน";

/* Icon editor; accessibility label */
"Shortcut icon editor" = "หน้าต่างแก้ไขไอคอนคำสั่งลัด";

/* Icon editor; segmented control option */
"Color" = "สี";

/* Icon editor; segmented control option */
"Glyph" = "สัญลักษณ์";

/* Icon editor; segmented control option */
"Home Screen" = "หน้าจอโฮม";

/* Import questions */
"Questions added here will be asked when this shortcut is imported on a different device. Answers to these questions will be filled into the shortcut." = "คำถามที่เพิ่มที่นี่จะถูกถามเมื่อคำสั่งลัดนี้ถูกนำเข้าไปไว้บนอุปกรณ์เครื่องอื่น คำตอบสำหรับคำถามเหล่านี้จะถูกนำเข้าไปไว้ในคำสั่งลัด";

/* Import questions */
"You can try your import questions using the “Customize Shortcut” button in this shortcut's settings." = "คุณสามารถลองใช้คำถามนำเข้าของคุณได้โดยใช้ปุ่ม “กำหนดคำสั่งลัด” ในการตั้งค่าของคำสั่งลัดนี้";

/* Import questions detail view */
"Default Answer" = "คำตอบเริ่มต้น";

/* Import questions detail view */
"Question Text" = "ข้อความคำถาม";

/* Import questions detail view */
"Type a question here…" = "ป้อนคำถามที่นี่…";

/* Import questions details view; navigation bar title */
"Details" = "รายละเอียด";

/* Import questions; button */
"Add New Question…" = "เพิ่มคำถามใหม่…";

/* Import questions; choose a parameter prompt */
"Choose a parameter from one of the actions below." = "เลือกพารามิเตอร์จากการกระทำประเภทใดประเภทหนึ่งด้านล่าง";

/* Import questions; choose parameter title */
"Choose a Parameter" = "เลือกพารามิเตอร์";

/* Import questions; no actions error message */
"This shortcut has no actions. Please add some actions to your shortcut before setting up Import Questions." = "คำสั่งลัดนี้ไม่มีการกระทำ โปรดเพิ่มการกระทำบางรายการไปยังคำสั่งลัดของคุณก่อนที่จะตั้งค่าการนำเข้าคำถาม";

/* Indicates what types of input the shortcut accepts; %@=list of types */
"This shortcut accepts %@" = "คำสั่งลัดนี้ยอมรับ %@";

/* Input types of action */
"Input" = "ป้อนข้อมูลเข้า";

/* Input variable description */
"Gets the output of the previous action." = "รับข้อมูลออกของการกระทำก่อนหน้า";

/* Install app icon; should match App Store GET button */
"GET" = "รับ";

/* Instructions on building a shortcut */
"Add actions from the bottom to build your shortcut." = "เพิ่มการกระทำจากด้านล่างสุดเพื่อสร้างคำสั่งลัดของคุณ";

/* Instructions on building a shortcut; please make sure to account for right-to-left layout */
"Add actions from the left to build your shortcut." = "เพิ่มการกระทำจากด้านซ้ายเพื่อสร้างคำสั่งลัดของคุณ";

/* Item can be anything */
"anything" = "อะไรก็ได้";

/* Keep all shortcuts */
"Keep All" = "เก็บทั้งหมด";

/* Keep shortcuts */
"Keep" = "เก็บ";

/* Keep shortcuts; %lu = number of shortcuts */
"Keep %lu" = "เก็บ %lu รายการ";

/* Label for accessibility custom action to expand actions card */
"Expand" = "ขยาย";

/* Label for accessibility custom action to minimize actions card */
"Collapse" = "ยุบ";

/* Label for types that the workflow accepts. */
"Accepted Types" = "ประเภทที่ยอมรับ";

/* Like 'Add new item' or 'Add new image' */
"Add %@" = "เพิ่ม %@";

/* List editor message (value = image, string, etc.) */
"What type of value do you want to add?" = "คุณต้องการเพิ่มค่าประเภทใด";

/* Long date formatting style */
"Long" = "ยาว";

/* Manage sharing */
"Manage Sharing" = "จัดการการแชร์";

/* Medium date formatting style */
"Medium" = "ปานกลาง";

/* Missing action error action */
"Update Shortcuts" = "อัพเดทคำสั่งลัด";

/* Missing action error title */
"This action could not be found in this version of Shortcuts." = "ไม่พบการกระทำนี้ในคำสั่งลัดเวอร์ชั่นนี้";

/* Name and store URL of product or item on App Store */
"Name and Store URL" = "ชื่อและ URL ร้าน";

/* Name of measurement unit */
"Unit (Name)" = "หน่วย";

/* Navigation bar title */
"Select a Magic Variable" = "เลือกตัวแปร Magic";

/* Navigation bar title; resolve workflow conflicts */
"Resolve Conflicts" = "แก้ไขข้อขัดแย้ง";

/* No variables avaiable error */
"⚠️ Variable not available." = "⚠️ ไม่มีตัวแปร";

/* None option */
"None" = "ไม่มี";

/* Note about using the action */
"Note" = "โน้ต";

/* Parameter already in use by another import question */
"Already In Use" = "ใช้งานอยู่แล้ว";

/* Parameter not supported for import question */
"Not Supported for Questions" = "ไม่รองรับคำถาม";

/* Piece of text */
"Text" = "ข้อความ";

/* Prompt displayed to the user when importing a shortcut where the source app is not known. */
"This shortcut was imported from another app. Are you sure you want to run it?" = "คำสั่งลัดนี้ถูกนำเข้ามาจากแอพอื่น คุณแน่ใจหรือไม่ว่าคุณต้องการสั่งทำงานคำสั่งลัดนี้";

/* RFC 2822 date formatting style */
"RFC 2822" = "RFC 2822";

/* Relative date formatting style */
"Relative" = "สัมพัทธ์";

/* Relative date or time formatting style */
"How Long Ago/Until" = "นานแค่ไหนแล้ว/อีกนานเท่าไหร่";

/* Remote device name for sync conflict when not known */
"Unknown Device" = "ไม่ทราบชื่ออุปกรณ์";

/* Rename Magic Variable prompt message; %@ = action name */
"This name will be used for all of this %@ action’s Magic Variables." = "ชื่อนี้จะถูกใช้กับตัวแปร Magic ของการกระทำ %@ นี้ทั้งหมด";

/* Rename Magic Variable prompt title */
"Rename Magic Variable" = "เปลี่ยนชื่อตัวแปร Magic";

/* Rename shortcut alert title */
"Rename Shortcut" = "เปลี่ยนชื่อคำสั่งลัด";

/* Rename shortcut message */
"Enter a new name for your shortcut." = "ป้อนชื่อใหม่ให้คำสั่งลัดของคุณ";

/* Rename workflow or variable */
"Rename" = "เปลี่ยนชื่อ";

/* Requirements for the action (having certain apps installed, iOS version, etc.) */
"Requires" = "ความต้องการ";

/* Result types of action */
"Result" = "ผลลัพธ์";

/* Reveal action that is associated with the variable */
"Reveal Action" = "แสดงการกระทำ";

/* Scripting category */
"Scripting" = "การเขียนสคริปต์";

/* Search bar placeholder or keycommand discoverability title */
"Search" = "ค้นหา";

/* Section header title; Apple Watch complication shortcuts */
"Complication Shortcuts" = "คำสั่งลัดของกลไกหน้าปัด";

/* Select all input types */
"Select All" = "เลือกทั้งหมด";

/* Sentence describing the current filter. The first argument (%@) is the search action and the second argument (%@) is the property (e.g. '`Find Calendar Events Where` `Start Date`…') */
"%@ %@…" = "%@%@…";

/* Sentence describing the current filter. The first argument (%@) is the search action, the second argument (%@) is the property and the third argument (%@) is the operator that is used (e.g. '`Find Calendar Events Where` `Start Date` `is in the next`…') */
"%@ %@ %@…" = "%@%@%@…";

/* Sentence describing the current filter. The first argument (%@) is the search action, the second argument (%@) is the property, the third argument (%@) is the operator that is used and the fourth argument (%@) is the value (e.g. '`Find Calendar Events Where` `Start Date` `is in the next` `5`…') */
"%@ %@ %@ %@…" = "%@%@%@ %@…";

/* Service name followed by account, e.g. Dropbox (johnmiller@gmail.com) */
"%@ (%@)" = "%@ (%@)";

/* Share a shortcut */
"Share Shortcut" = "แชร์คำสั่งลัด";

/* Share a workflow along with a description */
"Share with Description" = "แชร์พร้อมคำอธิบาย";

/* Share a workflow as a file */
"Share as File" = "แชร์เป็นไฟล์";

/* Share shortcut */
"Share" = "แชร์";

/* Short date formatting style */
"Short" = "แบบสั้น";

/* Shortcut contains no actions error description, %@=shortcut name */
"“%@” contains no actions." = "“%@” ไม่มีการกระทำ";

/* Shortcut contains no actions error title */
"Empty Shortcut" = "คำสั่งลัดว่างเปล่า";

/* Shortcut contains no actions error title */
"No Actions" = "ไม่มีการกระทำ";

/* Shortcut description placeholder */
"Customize Shortcut…" = "กำหนดคำสั่งลัดเอง…";

/* Shortcut icon */
"Icon" = "ไอคอน";

/* Shortcut picker; navigation bar title */
"Choose Shortcut" = "เลือกคำสั่งลัด";

/* Shortcut reordering; %1$@,%2$@ = shortcut names */
"Moved between %1$@ and %2$@" = "ย้ายระหว่าง %1$@ และ %2$@ แล้ว";

/* Shortcut reordering; %@ = shortcut name */
"Moved to end after %@" = "ย้ายไปไว้ท้ายสุดต่อจาก %@";

/* Shortcut reordering; %@ = shortcut name */
"Moved to top before %@" = "ย้ายไปไว้ด้านบนสุดก่อน %@";

/* Shortcut type selection view; widget info detail text */
"To use shortcuts from the Today Widget, follow a few simple steps to add the widget. Or, tap Done to set up later." = "ในการใช้คำสั่งลัดจากวิดเจ็ตวันนี้ ให้ทำตามขั้นตอนง่ายๆ ไม่กี่ขั้นตอนเพื่อเพิ่มวิดเจ็ต หรือแตะเสร็จสิ้นเพื่อตั้งค่าในภายหลัง";

/* Shortcut type selection view; widget info slogan text */
"Add the Today Widget to run shortcuts lightning fast." = "เพิ่มวิดเจ็ตวันนี้เพื่อสั่งทำงานคำสั่งลัดอย่างรวดเร็ว";

/* Shortcut types help view; accessiblity hint */
"Screenshot of a share sheet in Safari with the Shortcuts activity highlighted" = "ภาพหน้าจอของแผ่นงานการแชร์ใน Safari โดยที่กิจกรรมคำสั่งลัดถูกไฮไลท์อยู่";

/* Shortcut types help view; info label */
"Action Extension shortcuts are run from the share sheet inside other apps." = "คำสั่งลัดส่วนขยายการกระทำถูกสั่งทำงานจากแผ่นงานการแชร์ภายในแอพอื่นๆ";

/* Shortcut types help view; info label */
"Today Widget shortcuts are run in Notification Center by pulling down from the top of the screen." = "คำสั่งลัดวิดเจ็ตวันนี้ถูกสั่งทำงานในศูนย์การแจ้งเตือนโดยการดึงลงมาจากด้านบนสุดของหน้าจอ";

/* Shortcut types help view; title */
"Shortcut Types" = "ประเภทคำสั่งลัด";

/* Shortcut was deleted on a specified device */
"Deleted on %@" = "ลบบน %@ แล้ว";

/* Shortcut was deleted on another device */
"Deleted on another device" = "ลบบนอุปกรณ์เครื่องอื่นแล้ว";

/* Shortcut was modified on a specified device */
"Modified on %@" = "แก้ไขบน %@";

/* Shortcut was modified on another device */
"Modified on another device" = "แก้ไขบนอุปกรณ์เครื่องอื่นแล้ว";

/* Shortcuts picker; search bar placeholder */
"Search shortcuts…" = "ค้นหาคำสั่งลัด…";

/* Shortcuts types help view; accessibility label */
"Screenshot of the Shortcuts widget in Notification Center" = "ภาพหน้าจอของวิดเจ็ตคำสั่งลัดในศูนย์การแจ้งเตือน";

/* Siri phrase */
"“%@”" = "“%@”";

/* Skip gallery shortcut import configuration */
"Skip Setup" = "ข้ามการตั้งค่า";

/* Specifies how the automatic capitalization of the name of a shortcut should work: 0 = No auto capitalization, 1 = Only the first word, 2 = All words */
"Auto-capitalization for Shortcut Name" = "2";

/* Stop sharing the link to a shortcut */
"Stop Sharing" = "หยุดแชร์";

/* Submit a workflow to the gallery */
"Submit to Gallery" = "ส่งไปยังแกลเลอรี่";

/* Tap to choose an option */
"Tap to Choose" = "แตะเพื่อเลือก";

/* Text when sharing a shortcut */
"Check out the shortcut I built!" = "ตรวจดูคำสั่งลัดที่ฉันสร้างไว้!!";

/* The accessibility label for the actions table view container */
"Actions Controller" = "ตัวควบคุมการกระทำ";

/* The location of the share button in Safari on iPad */
"the bottom of the screen" = "ด้านล่างสุดของหน้าจอ";

/* The location of the share button in Safari on iPad */
"the top right of the screen" = "ด้านขวาบนสุดของหน้าจอ";

/* The workflow accepts anything as input. Shown like “Accepts Anything” */
"Anything" = "อะไรก็ได้";

/* The workflow accepts nothing as input. Shown like “Accepts Nothing” */
"Nothing" = "ไม่มีอะไร";

/* Title */
"Actions" = "การกระทำ";

/* Title */
"Date Format" = "รูปแบบวันที่";

/* Title */
"Requires Handoff" = "ต้องใช้ Handoff";

/* Title */
"Shortcuts" = "คำสั่งลัด";

/* Title */
"Time Format" = "รูปแบบเวลา";

/* Title */
"Type" = "ประเภท";

/* Title for action drawer categories view */
"Categories" = "หมวดหมู่";

/* Title for configuration page for unit */
"Unit (Title)" = "หน่วย";

/* Title of main screen showing your library of shortcuts */
"Library" = "คลัง";

/* Title of the view controller that allows the user to control which shortcuts appear in the Today Widget */
"Customize Shortcuts" = "กำหนดคำสั่งลัดเอง";

/* Title or button */
"Import Questions" = "นำเข้าคำถาม";

/* Today widget explanation */
"Boom! Your Today Widget is set up." = "ตู้ม! วิดเจ็ตวันนี้ของคุณถูกตั้งค่าแล้ว";

/* Today widget explanation */
"Next, grab some Today Widget shortcuts from the Gallery." = "จากนั้นให้เก็บคำสั่งลัดบางรายการในวิดเจ็ตวันนี้จากแกลเลอรี่";

/* Today widget explanation */
"With the Shortcuts Today Widget, you can run shortcuts in a single tap from any app just by pulling down Notification Center." = "ด้วยวิดเจ็ตวันนี้ในคำสั่งลัด คุณจะสามารถสั่งทำงานคำสั่งลัดได้ด้วยการแตะหนึ่งครั้งจากแอพใดก็ได้โดยเพียงแค่ดึงศูนย์การแจ้งเตือนลงมา";

/* Today widget explanation button */
"Add Widget" = "เพิ่มวิดเจ็ต";

/* Today widget explanation button */
"View the Gallery" = "ดูแกลเลอรี่";

/* Today widget explanation; please do not localize %MODEL% */
"Run shortcuts lightning fast, from anywhere on your %MODEL%." = "สั่งทำงานคำสั่งลัดอย่างรวดเร็วจากที่ใดก็ได้บน %MODEL% ของคุณ";

/* Unknown item */
"Unknown" = "ไม่ทราบชื่อ";

/* Used in a phrase like 'Add new item' */
"new item" = "รายการใหม่";

/* User’s favorited workflows or actions */
"Favorites" = "รายการโปรด";

/* Variable field placeholder */
"Variable Name" = "ชื่อตัวแปร";

/* Variable picker; none available error message */
"You can create a variable by adding a “Set Variable” action." = "คุณสามารถสร้างตัวแปรได้โดยเพิ่มการกระทำ “ตั้งค่าตัวแปร”";

/* Varible picker; none available error title */
"No Variables Are Available" = "ไม่มีตัวแปรให้ใช้งานได้";

/* Workflow conflicts; navigation bar back button title */
"Conflicts" = "ข้อขัดแย้ง";

/* Workflow import flow title shown above import question */
"Configure This Shortcut" = "กำหนดค่าคำสั่งลัดนี้";

/* Workflow name */
"Name of Shortcut" = "ชื่อ";

/* Workflow type selection view */
"Tap Done to continue editing your shortcut." = "แตะเสร็จสิ้นเพื่อดำเนินการแก้ไขคำสั่งลัดของคุณต่อ";

/* Workflow types help view; accessibility hint */
"Screenshot of the Shortcuts watch app" = "ภาพหน้าจอของคำสั่งลัดในแอพนาฬิกา";

/* Workflow types help view; info label */
"Apple Watch shortcuts are run from your wrist via the Shortcuts watch app or Complication." = "คำสั่งลัดของ Apple Watch ถูกเรียกใช้จากข้อมือของคุณผ่านแอพนาฬิกาข้อมือในคำสั่งลัดหรือกลไกหน้าปัด";

/* Workflow types help view; instructions label */
"How do I find the Today Widget?" = "ฉันจะพบวิดเจ็ตวันนี้ได้อย่างไร";

/* iOS Today Widget */
"Today Widget" = "วิดเจ็ตวันนี้";

